In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from pandas.plotting import register_matplotlib_converters
from pylab import rcParams
sns.set_style("darkgrid")

import warnings
warnings.filterwarnings("ignore")

In [2]:
df=pd.read_csv('sales_082020.csv')
df.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03
1,o79pns1qwo,GB,50xki2yg,GB,38chj507o6h2,Outerwear,Adidas Originals,GBP,15.92,2020-08-09
2,sjgbjdkhqx,GB,50xki2yg,GB,i9ynyxj5tdp8,Tops - Mens,NaN,GBP,6.37,2020-08-07
3,o79pns1qwo,GB,s0p322hh,GB,t50xe7moye8v,Tops - Mens,Berghaus,GBP,25.27,2020-08-09
4,o79pns1qwo,GB,dpkx192v,GB,hp4r9bjq68af,Bottoms - Womens,NaN,GBP,8.90,2020-08-09

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237671 entries, 0 to 237670
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   buyer_id        237671 non-null  object
 1   buyer_country   237671 non-null  object
 2   seller_id       237671 non-null  object
 3   seller_country  237671 non-null  object
 4   product_code    237671 non-null  object
 5   category        237655 non-null  object
 6   brand           119330 non-null  object
 7   currency        237671 non-null  object
 8   price           237671 non-null  float64
 9   date            237671 non-null  object
dtypes: float64(1), object(9)
memory usage: 18.1+ MB

In [3]:
df0= pd.read_csv('currency_rates_082020_EUR.csv')
df0

    currency       date    rate
0        EUR   8/1/2020  1.0000
1        EUR   8/2/2020  1.0000
2        EUR   8/3/2020  1.0000
3        EUR   8/4/2020  1.0000
4        EUR   8/5/2020  1.0000
..       ...        ...     ...
215      BRL   8/6/2020  6.3324
216      BRL   8/7/2020  6.4111
217      BRL   8/8/2020  6.4111
218      BRL   8/9/2020  6.4111
219      BRL  8/10/2020  6.4351

[220 rows x 3 columns]

In [8]:
dfs= df.copy()
dfc= df0.copy()

In [9]:
dfs.date = pd.to_datetime(dfs.date)

In [10]:
dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237671 entries, 0 to 237670
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   buyer_id        237671 non-null  object
 1   buyer_country   237671 non-null  object
 2   seller_id       237671 non-null  object
 3   seller_country  237671 non-null  object
 4   product_code    237671 non-null  object
 5   category        237655 non-null  object
 6   brand           119330 non-null  object
 7   currency        237671 non-null  object
 8   price           237671 non-null  float64
 9   date            237671 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(8)
memory usage: 18.1+ MB

In [11]:
dfc.date= pd.to_datetime(dfc.date)

In [12]:
dfc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 220 entries, 0 to 219
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   currency  220 non-null    object
 1   date      220 non-null    datetime64[ns]
 2   rate      220 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 5.3+ KB

In [13]:
df_new = pd.merge(dfs, dfc, how= 'inner', on= ['currency', 'date'])
df_new.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935
1,rd209r8c7c,GB,9p2ansc9,GB,wpxxf59cq7pc,Outerwear - Mens,Adidas Originals,GBP,24.91,2020-08-03,0.89935
2,pqbcrl8azx,GB,r9zmzem8,GB,ua9mmn86wsqy,Tops - Womens,NaN,GBP,19.31,2020-08-03,0.89935
3,j5en1rwmxp,GB,3o2nz88r,GB,tduo2uy8iszl,Bottoms - Womens,Urban Outfitters,GBP,16.98,2020-08-03,0.89935
4,kjdezxeh1l,GB,7g56ublf,GB,39o00tcu89zq,Other,NaN,GBP,2.85,2020-08-03,0.89935

In [14]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 237671 entries, 0 to 237670
Data columns (total 11 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   buyer_id        237671 non-null  object
 1   buyer_country   237671 non-null  object
 2   seller_id       237671 non-null  object
 3   seller_country  237671 non-null  object
 4   product_code    237671 non-null  object
 5   category        237655 non-null  object
 6   brand           119330 non-null  object
 7   currency        237671 non-null  object
 8   price           237671 non-null  float64
 9   date            237671 non-null  datetime64[ns]
 10  rate            237671 non-null  float64
dtypes: datetime64[ns](1), float64(2), object(8)
memory usage: 21.8+ MB

In [16]:
df_new['total']= df_new.price / df_new.rate
df_new.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935,21.248680
1,rd209r8c7c,GB,9p2ansc9,GB,wpxxf59cq7pc,Outerwear - Mens,Adidas Originals,GBP,24.91,2020-08-03,0.89935,27.697782
2,pqbcrl8azx,GB,r9zmzem8,GB,ua9mmn86wsqy,Tops - Womens,NaN,GBP,19.31,2020-08-03,0.89935,21.471062
3,j5en1rwmxp,GB,3o2nz88r,GB,tduo2uy8iszl,Bottoms - Womens,Urban Outfitters,GBP,16.98,2020-08-03,0.89935,18.880302
4,kjdezxeh1l,GB,7g56ublf,GB,39o00tcu89zq,Other,NaN,GBP,2.85,2020-08-03,0.89935,3.168955

In [18]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 237671 entries, 0 to 237670
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   buyer_id        237671 non-null  object
 1   buyer_country   237671 non-null  object
 2   seller_id       237671 non-null  object
 3   seller_country  237671 non-null  object
 4   product_code    237671 non-null  object
 5   category        237655 non-null  object
 6   brand           119330 non-null  object
 7   currency        237671 non-null  object
 8   price           237671 non-null  float64
 9   date            237671 non-null  datetime64[ns]
 10  rate            237671 non-null  float64
 11  total           237671 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(8)
memory usage: 23.6+ MB

##  1. Which country made the highest percentage of international purchases?

In [21]:
df_new['total'].sum().round()

6471511.0

In [25]:
df_new.groupby('buyer_country')['total'].sum().round()

buyer_country
AU      219762.0
CA       66565.0
DE       25495.0
FR       18359.0
GB     3578790.0
IE      115571.0
IT      164237.0
RoW     154262.0
US     2128470.0
Name: total, dtype: float64

In [107]:
df_new.groupby('buyer_country')['total'].sum().apply(lambda x : (x/6471511.0)*100).round(1)

buyer_country
AU      3.4
CA      1.0
DE      0.4
FR      0.3
GB     55.3
IE      1.8
IT      2.5
RoW     2.4
US     32.9
Name: total, dtype: float64

In [124]:
df_new.groupby('buyer_country')['total'].sum()/df_new['total'].sum().round()

buyer_country
AU     0.033958
CA     0.010286
DE     0.003940
FR     0.002837
GB     0.553007
IE     0.017858
IT     0.025378
RoW    0.023837
US     0.328898
Name: total, dtype: float64

In [27]:
df_new.groupby('seller_country')['total'].sum().apply(lambda x : (x/6471511.0)*100).round()

seller_country
AU      3.0
CA      1.0
DE      0.0
FR      0.0
GB     59.0
IE      1.0
IT      3.0
RoW     1.0
US     33.0
Name: total, dtype: float64

## 2. Which day has the highest value of purchases?

In [36]:
df_new.groupby('date')['total'].sum().round().sort_values()

date
2020-08-05     770518.0
2020-08-06     858224.0
2020-08-04     935129.0
2020-08-09     946702.0
2020-08-07     966149.0
2020-08-08     989508.0
2020-08-03    1005281.0
Name: total, dtype: float64

In [37]:
df_new.groupby('date')['total'].max().round().sort_values()

date
2020-08-05    1039.0
2020-08-08    1141.0
2020-08-09    1312.0
2020-08-07    1644.0
2020-08-06    2205.0
2020-08-04    2330.0
2020-08-03    3045.0
Name: total, dtype: float64

## 3. Which category has 2,324 transactions on 7 August?

In [53]:
df_new[df_new.date== '2020-08-07'].groupby('category')['category'].value_counts()

category           category
Accessories        Accessories          3090
Art                Art                   333
Beauty             Beauty               1297
Books & magazines  Books & magazines     154
Bottoms - Mens     Bottoms - Mens        826
Bottoms - Womens   Bottoms - Womens     4571
Dresses            Dresses              3079
Film               Film                   64
Home               Home                  514
Jewellery          Jewellery            2324
Kids               Kids                  317
Lingerie           Lingerie              788
Music              Music                 336
Other              Other                1014
Outerwear          Outerwear             917
Outerwear - Mens   Outerwear - Mens      552
Shoes              Shoes                3292
Sports equipment   Sports equipment       63
Tech               Tech                  539
Tops - Mens        Tops - Mens          4835
Tops - Womens      Tops - Womens        6798
Transportation     Transportation         16
UNSPECIFIED        UNSPECIFIED             1
Underwear          Underwear              24
Name: category, dtype: int64

In [54]:
df_new.date.value_counts()

2020-08-08    36541
2020-08-03    36150
2020-08-07    35745
2020-08-09    34764
2020-08-04    33525
2020-08-06    32639
2020-08-05    28307
Name: date, dtype: int64

## 4. What percentage of global sales value on 4 August came from US sellers?

In [56]:
df_new[df_new.date== '2020-08-04'].groupby('seller_country')['total'].sum().round()

seller_country
AU      26224.0
CA       6961.0
DE       1486.0
FR        511.0
GB     544079.0
IE      10062.0
IT      27508.0
RoW      7165.0
US     311133.0
Name: total, dtype: float64

In [118]:
df_new[df_new.date== '2020-08-04']['total'].sum()

935129.3255536666

In [119]:
df_new[df_new.date== '2020-08-04'].groupby('seller_country')['total'].sum().apply(lambda x : (x/df_new[df_new.date== '2020-08-04']['total'].sum())*100)

seller_country
AU      2.804298
CA      0.744339
DE      0.158942
FR      0.054632
GB     58.182273
IE      1.076052
IT      2.941603
RoW     0.766201
US     33.271659
Name: total, dtype: float64

In [120]:
df_new[df_new.date== '2020-08-04'].groupby('seller_country')['total'].sum().apply(lambda x : (x/df_new[df_new.date== '2020-08-04']['total'].sum())*100).round(1)

seller_country
AU      2.8
CA      0.7
DE      0.2
FR      0.1
GB     58.2
IE      1.1
IT      2.9
RoW     0.8
US     33.3
Name: total, dtype: float64

In [62]:
df_new.groupby('seller_country')['total'].sum().apply(lambda x : (x/df_new['total'].sum())*100).round()

seller_country
AU      3.0
CA      1.0
DE      0.0
FR      0.0
GB     59.0
IE      1.0
IT      3.0
RoW     1.0
US     33.0
Name: total, dtype: float64

In [114]:
df_new[df_new.date== '2020-08-04'].groupby('seller_country')['total'].sum().apply(lambda x : (x/df_new['total'].sum())*100)

seller_country
AU     0.405219
CA     0.107557
DE     0.022967
FR     0.007894
GB     8.407303
IE     0.155489
IT     0.425060
RoW    0.110716
US     4.807734
Name: total, dtype: float64

## 5. How many sellers in US has more than 75 sales?

In [66]:
df_new[df_new['seller_country']== 'US'].groupby('seller_id')['seller_id'].count().sort_values(ascending=False)

seller_id
pzsiehl0    703
wd3rgi3q    525
j21w87xy    500
ucp2k0nu    218
r64zesw6    211
           ...
evo9d2vu      1
evl1txv5      1
evkjcu3x      1
evjivady      1
i07ohhd1      1
Name: seller_id, Length: 34119, dtype: int64

In [68]:
(df_new[df_new['seller_country']== 'US'].groupby('seller_id')['seller_id'].count()> 75).sum()

22

In [72]:
(df_new[df_new['seller_country']== 'US'].groupby('seller_id')['seller_id'].count()>= 75).sum()

22

## 6. Which seller in the US sold the most in terms of value?

In [123]:
df_new[df_new['seller_country']== 'US'].groupby('seller_id')['total'].sum().sort_values().round(2)

seller_id
lm7s1mb8        0.89
q30kdgu9        0.89
vgpfz2la        0.89
zwmoawx5        0.89
2ylrpzdc        0.89
              ...
j21w87xy     4728.39
k4cbl88u     4913.33
ys8t8gfo     5071.18
wd3rgi3q     9005.92
pzsiehl0    20558.87
Name: total, Length: 34119, dtype: float64

In [78]:
df_new[df_new['seller_country']== 'US'].groupby('seller_id')['total'].max().sort_values()

seller_id
lm7s1mb8       0.888742
zwmoawx5       0.888742
vgpfz2la       0.888742
q30kdgu9       0.888742
2ylrpzdc       0.890748
               ...
4w2wrffo     850.263872
0wxk6xem     858.206535
3nr37hmd     894.921050
f1tj5aj3    1004.896262
o68e2qco    3045.065881
Name: total, Length: 34119, dtype: float64

## 7. Which brand had the largest absolute € difference in average transaction value between domestic and international?

In [79]:
df_new.head()

,buyer_id,buyer_country,seller_id,seller_country,product_code,category,brand,currency,price,date,rate,total
0,qzpjsi9t0o,GB,6oufpaot,GB,ydecnydr6obf,Dresses,NaN,GBP,19.11,2020-08-03,0.89935,21.248680
1,rd209r8c7c,GB,9p2ansc9,GB,wpxxf59cq7pc,Outerwear - Mens,Adidas Originals,GBP,24.91,2020-08-03,0.89935,27.697782
2,pqbcrl8azx,GB,r9zmzem8,GB,ua9mmn86wsqy,Tops - Womens,NaN,GBP,19.31,2020-08-03,0.89935,21.471062
3,j5en1rwmxp,GB,3o2nz88r,GB,tduo2uy8iszl,Bottoms - Womens,Urban Outfitters,GBP,16.98,2020-08-03,0.89935,18.880302
4,kjdezxeh1l,GB,7g56ublf,GB,39o00tcu89zq,Other,NaN,GBP,2.85,2020-08-03,0.89935,3.168955

In [88]:
a1= df_new[df_new['buyer_country']== df_new['seller_country']].groupby('brand')['total'].mean().sort_values(ascending= False)
a1

brand
TAG Heuer           224.586782
Canada Goose        216.424622
Emilio Pucci        214.758636
Loeffler Randall    207.720370
Goyard              202.661941
                       ...
Popular Sports        4.452175
Max Factor            4.329298
Bronica               3.329066
360 Cashmere          0.950906
36572                 0.950199
Name: total, Length: 1121, dtype: float64

In [89]:
a2= df_new[df_new['buyer_country'] != df_new['seller_country']].groupby('brand')['total'].mean().sort_values(ascending= False)
a2

brand
Goyard          611.456926
Loewe           461.082817
Needles         314.338133
Hermes          267.749153
Craig Green     266.792684
                   ...
Canada Goose      6.195821
NICCE             5.377624
Skinnydip         4.740491
COS               1.189748
Old Navy          0.960680
Name: total, Length: 440, dtype: float64

In [90]:
df1= pd.DataFrame(a1)
df1

                       total
brand
TAG Heuer         224.586782
Canada Goose      216.424622
Emilio Pucci      214.758636
Loeffler Randall  207.720370
Goyard            202.661941
...                      ...
Popular Sports      4.452175
Max Factor          4.329298
Bronica             3.329066
360 Cashmere        0.950906
36572               0.950199

[1121 rows x 1 columns]

In [97]:
df2= pd.DataFrame(a2)
df2

                   total
brand
Goyard        611.456926
Loewe         461.082817
Needles       314.338133
Hermes        267.749153
Craig Green   266.792684
...                  ...
Canada Goose    6.195821
NICCE           5.377624
Skinnydip       4.740491
COS             1.189748
Old Navy        0.960680

[440 rows x 1 columns]

In [103]:
(df1['total']-df2['total']).sort_values(ascending= False)

brand
Canada Goose       210.228801
Rick Owens         121.425453
Mansur Gavriel      68.068936
Maison Margiela     52.279287
Balmain             49.713976
                      ...
francesca's               NaN
kensie                    NaN
liquid blue               NaN
mixxmix                   NaN
philosophy                NaN
Name: total, Length: 1134, dtype: float64

In [128]:
(df1['total']-df2['total']).sort_values()

brand
Goyard               -408.794985
Loewe                -379.657343
Hermes               -210.700192
Needles              -198.880051
Jean-Paul Gaultier   -192.660687
                         ...
francesca's                  NaN
kensie                       NaN
liquid blue                  NaN
mixxmix                      NaN
philosophy                   NaN
Name: total, Length: 1134, dtype: float64

In [127]:
np.abs(df1-df2).sort_values(by='total',ascending=False)

                   total
brand
Goyard        408.794985
Loewe         379.657343
Hermes        210.700192
Canada Goose  210.228801
Needles       198.880051
...                  ...
francesca's          NaN
kensie               NaN
liquid blue          NaN
mixxmix              NaN
philosophy           NaN

[1134 rows x 1 columns]